lsp/lsp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-07 Tue 08:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>IDE Features provided by LSP</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://github.com/fniessen/org-html-themes/tree/master/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://github.com/fniessen/org-html-themes/tree/master/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3aa92bd">Overview</a></li>
<li><a href="#orga056524">Show and Tell</a>
<ul>
<li><a href="#org223f230">Automatic Pop-ups</a></li>
<li><a href="#org8c3348c">Name Completions</a></li>
<li><a href="#org0c28bfb">Jumping to Definitions</a></li>
<li><a href="#orgad8511a">Call Hierarchy</a></li>
</ul>
</li>
<li><a href="#orgc076c66">How to Setup</a></li>
<li><a href="#org4498e71">How to Use</a></li>
<li><a href="#orgb491b13">How it Works</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3aa92bd" class="outline-2">
<h2 id="org3aa92bd">Overview</h2>
<div class="outline-text-2" id="text-org3aa92bd">
<p>
I would like to share my experience with very useful IDE (Integrated
Development Environment) features available these days for many programming
languages especially C++ which is becoming harder to read without a modern
IDE.
</p>

<p>
I wrote this document and placed on my public github repo at
<a href="https://github.com/emacs18/notes/tree/master/lsp">https://github.com/emacs18/notes/tree/master/lsp</a>. I just needed a place that
I could access from my personal laptop to my work laptop so that I can
transfer files from home to work.
</p>

<p>
<a href="#orga056524">Show and Tell</a> section has few short videos to demonstrate some of the features.
</p>

<p>
<a href="#orgc076c66">How to Setup</a> and <a href="#org4498e71">How to Use</a> sections need to be written.
</p>
</div>
</div>

<div id="outline-container-orga056524" class="outline-2">
<h2 id="orga056524">Show and Tell</h2>
<div class="outline-text-2" id="text-orga056524">
<p>
I prepared few short videos to demonstrate some of the features of the C++
IDE. I used a screen capture program called Kazam to create these videos on
my personal laptop running Ubuntu 18.04.
</p>
</div>

<div id="outline-container-org223f230" class="outline-3">
<h3 id="org223f230">Automatic Pop-ups</h3>
<div class="outline-text-3" id="text-org223f230">
<p>
<a href="pop-ups.webm">pop-ups.webm</a> is a three minute video which demonstrate following types of
pop-ups that automatically show up as the cursor is moved around.
</p>

<ul class="org-ul">
<li>full type information about all symbols on current line</li>
<li>more complete information on the current symbol under cursor at bottom</li>
<li>documentation pop-up for symbol at cursor</li>
</ul>
</div>
</div>

<div id="outline-container-org8c3348c" class="outline-3">
<h3 id="org8c3348c">Name Completions</h3>
<div class="outline-text-3" id="text-org8c3348c">
<p>
<a href="name-completions.webm">name-completions.webm</a> is a three minute video which demonstrate name
completion pop-ups.
</p>

<ul class="org-ul">
<li>completion is provided for most incomplete expressions</li>
<li>convenience feature to help typing function arguments</li>
<li>fuzzy matching and auto correction</li>
</ul>
</div>
</div>

<div id="outline-container-org0c28bfb" class="outline-3">
<h3 id="org0c28bfb">Jumping to Definitions</h3>
<div class="outline-text-3" id="text-org0c28bfb">
<p>
<a href="jumping-to-definition.webm">jumping-to-definition.webm</a> is a 2 to 3 minute video demonstrating how one
can quickly jump to places of definition for not only types and functions,
but also local variables, function arguments, and even overloaded operators.
</p>
</div>
</div>

<div id="outline-container-orgad8511a" class="outline-3">
<h3 id="orgad8511a">Call Hierarchy</h3>
<div class="outline-text-3" id="text-orgad8511a">
<p>
<a href="call-hierarchy.webm">call-hierarchy.webm</a> is a 3 to 4 minute video which shows you how you 
can not only list but jump around the call hiearchy.
</p>

<p>
Caller hierarchy displays "called by" relationships via indentation, i.e.,
if A is called by B and C, then B and C are shown under A indented to the
right.
</p>

<pre class="example">
   A
       B
       C
</pre>

<p>
Callee hierarchy displays "callee" relationships, where if B and C are
called within A, then the called functions are indented like this:
</p>

<pre class="example">
   A
       B
       C
</pre>

<p>
You can collapse or expand the hierarchy simply by hitting <code>TAB</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc076c66" class="outline-2">
<h2 id="orgc076c66">How to Setup</h2>
<div class="outline-text-2" id="text-orgc076c66">
<p>
To be written.
</p>

<p>
I plan on detailing how I use
spacemacs, along with 
lsp
ccls
</p>
</div>
</div>

<div id="outline-container-org4498e71" class="outline-2">
<h2 id="org4498e71">How to Use</h2>
<div class="outline-text-2" id="text-org4498e71">
<p>
To be written.
</p>
</div>
</div>

<div id="outline-container-orgb491b13" class="outline-2">
<h2 id="orgb491b13">How it Works</h2>
<div class="outline-text-2" id="text-orgb491b13">
<p>
The <a href="https://github.com/Microsoft/language-server-protocol">Language Server Protocol</a> (see also <a href="https://en.wikipedia.org/wiki/Language_Server_Protocol">wikipedia article</a>) defines a
communication protocol which defines the roles of IDE's (e.g., emacs, vim,
eclipse, etc., also known as frontends) and code parsers (also known as
backends) so that the same IDE can work for many different languages so long
as backends are available for them.
</p>

<p>
Today many frontends and backends are available to allow rich IDE features for
many languages. As mentioned at <a href="https://langserver.org/">https://langserver.org/</a>, <a href="https://www.gnu.org/software/emacs">emacs</a> is one of many
LSP frontends. Also <a href="https://github.com/MaskRay/ccls">ccls</a> is one of several C++ backends. In addition <a href="https://github.com/syl20bnr/spacemacs">spacemacs</a>
is a very large add-on to emacs which provides many features including very
comprehensive vim emulation as well as LSP.
</p>

<p>
My setup uses <a href="https://www.gnu.org/software/emacs">emacs</a>, <a href="https://github.com/MaskRay/ccls">ccls</a>, and <a href="https://github.com/syl20bnr/spacemacs">spacemacs</a>. I use both vim and emacs styles
within spacemacs.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-04-07 Tue 08:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
